Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 bidirectional (Bidirectiona  (None, 206, 256)         133120    
 l)                                                              
                                                                 
 dropout (Dropout)           (None, 206, 256)          0         
                                                                 
 bidirectional_1 (Bidirectio  (None, 128)              164352    
 nal)                                                            
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense (Dense)               (None, 32)                4128      
                                                                 
 dense_1 (Dense)             (None, 1)                 33        
                                                                 
=================================================================
Total params: 301,633
Trainable params: 301,633
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
  169/10273 [..............................] - ETA: 2:54:06 - loss: nan

